"""
Author: Petrov Yegor
2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см * число см толщины полотна. Проверить работу метода.
Например: 20м * 5000м * 25кг * 5см = 12500 т
"""

class Road:
    def __init__(self, length, width):
       self._length = length
       self._width = width

    def estimate(self, weight, thickness):
        return self._length * self._width * weight * thickness

road_a = Road(20, 5000)
road_b = Road(10, 3000)

print(road_a.estimate(25, 0.05))
print(road_b.estimate(25, 0.05))
